## Q1. 引入 train.csv 資料集

In [1]:
import pandas as pd

In [5]:
train = pd.read_csv('train.csv')

In [6]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Q2.將traing資料集資料欄位存成 list

In [7]:
train.columns.tolist()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

## Q3.traing資料集年齡最大跟最小的是？

In [13]:
max(train.Age), min(train.Age)

(80.0, 0.42)

In [15]:
train.Age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

## Q4.這個traing資料集資料的遺漏值狀況為何？

In [9]:
def count_col_null(df):
    '''
    Args:
        df: input dataframe
    Return:
        null_data_df: to count null by each column with a dataframe
    '''
    null_data = []
    for i in range(len(df.columns)):
        null_data.append(sum(df.iloc[:, i].isnull()))
    null_data_df = pd.DataFrame({
                   "columns": list(df.columns),
                   "null_counts": null_data
                    })
    return null_data_df

count_col_null(train)

        columns  null_counts
0   PassengerId            0
1      Survived            0
2        Pclass            0
3          Name            0
4           Sex            0
5           Age          177
6         SibSp            0
7         Parch            0
8        Ticket            0
9          Fare            0
10        Cabin          687
11     Embarked            2

## Q5.計算traing資料集男女的存活率

[hint](https://pandas.pydata.org/docs/reference/api/pandas.Series.value_counts.html)

In [28]:
train.Survived[train.Sex == 'male'].value_counts(normalize=True)

0    0.811092
1    0.188908
Name: Survived, dtype: float64

In [29]:
train.Survived[train.Sex == 'female'].value_counts(normalize=True)

1    0.742038
0    0.257962
Name: Survived, dtype: float64

## Q6.計算traing資料集名稱有 Mr. 是幾人?

In [41]:
train[train.Name.str.find('Mr.')!= -1].shape[0]

517

## Q7.traing資料集總共有幾種票價?

In [49]:
len(train.Fare.value_counts())

248

## Q8.依據是否生存為群組，traing資料集分別計算票價和年齡的總和、平均數、中位數

In [51]:
import numpy as np

In [55]:
train.groupby('Survived')['Fare', 'Age'].agg([len,np.sum, np.mean, np.median])

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

           Fare                                  Age                       \
            len         sum       mean median    len       sum       mean
Survived
0         549.0  12142.7199  22.117887   10.5  549.0  12985.50  30.626179
1         342.0  16551.2294  48.395408   26.0  342.0   8219.67  28.343690


         median
Survived
0          28.0
1          28.0

## Q8.將 train 和 test 合併起來

In [56]:
test = pd.read_csv('test.csv')

In [62]:
data = pd.concat([train, test]).reset_index(drop=True)
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,NaN,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1305,1306,NaN,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1306,1307,NaN,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1307,1308,NaN,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1308,1309,NaN,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [ ]:
df[]